NSCameraUsageDescription = "Norint nuskaityti dokumentus bei daryti nuotraukas ir vaizdo įrašus, reikalingas prieiga prie kameros.";
NSFaceIDUsageDescription = "Norint prisijungti naudojant veido atpažinimo funkciją, būtina naudoti „Face ID“.";
NSLocationAlwaysUsageDescription = "Programėlė naudoja jūsų buvimo vietą, kad automatiškai pradėtų failų įkėlimą, kai jūs persikeliate iš vienos vietos į kitą.";
NSPhotoLibraryUsageDescription = "Norint įkelti nuotraukas ir vaizdo įrašus į debesį, reikia suteikti prieigą prie nuotraukų bibliotekos.";
NSPhotoLibraryAddUsageDescription = "Norint įkelti nuotraukas ir vaizdo įrašus į debesį, reikia suteikti prieigą prie nuotraukų bibliotekos.";
NSMicrophoneUsageDescription = "Norint kurti balso užrašus, reikalingas prieiga prie mikrofono.";
NSLocationWhenInUseUsageDescription = "Ši programa naudoja jūsų buvimo vietą, kad nustatytų judėjimą ir automatiškai įkeltų failus. Ji nenaudoja GPS ir nesaugo jūsų buvimo vietos.";
NSLocationAlwaysAndWhenInUseUsageDescription = "Šiai programai reikia prieigos prie jūsų buvimo vietos net ir veikiant fone, kad ji galėtų automatiškai pradėti įkelti failus, kai aptinkamas reikšmingas judėjimas. GPS nenaudojamas.";
